<?php
$RU = [
	'RU-AD' => [
		'name' => 'Адыгея', // Республика Адыгея
		'lat'  => '44.39',
		'lon'  => '40.00',
		'code' => '01'
	],
	'RU-AL' => [
		'name' => 'Республика Алтай',
		'lat'  => '50.55',
		'lon'  => '86.55',
		'code' => '04'
	],
	'RU-BA' => [
		'name' => 'Башкортостан', // Республика Башкортостан
		'lat'  => '54.28',
		'lon'  => '56.16',
		'code' => '02'
	],
	'RU-BU' => [
		'name' => 'Республика Бурятия',
		'lat'  => '53.48',
		'lon'  => '109.20',
		'code' => '03'
	],
	'RU-DA' => [
		'name' => 'Дагестан', // Республика Дагестан
		'lat'  => '43.06',
		'lon'  => '46.53',
		'code' => '05'
	],
	'RU-IN' => [
		'name' => 'Ингушетия', // Республика Ингушетия
		'lat'  => '43.12',
		'lon'  => '44.58',
		'code' => '06'
	],
	'RU-KB' => [
		'name' => 'Кабардино-Балкария', // Кабардино-Балкарская республика
		'lat'  => '43.35',
		'lon'  => '43.24',
		'code' => '07'
	],
	'RU-KL' => [
		'name' => 'Калмыкия', // Республика Калмыкия
		'lat'  => '46.34',
		'lon'  => '45.19',
		'code' => '08'
	],
	'RU-KC' => [
		'name' => 'Карачаево-Черкесия', // Карачаево-Черкесская республика
		'lat'  => '43.55',
		'lon'  => '41.47',
		'code' => '09'
	],
	'RU-KR' => [
		'name' => 'Республика Карелия', // Республика Карелия
		'lat'  => '63.49',
		'lon'  => '33.00',
		'code' => '10'
	],
	'RU-KO' => [
		'name' => 'Республика Коми',
		'lat'  => '64.17',
		'lon'  => '54.28',
		'code' => '11'
	],
	'RU-CR' => [
		'name' => 'Республика Крым',
		'lat'  => '44.56',
		'lon'  => '34.06',
		'code' => '91'
	],
	'RU-ME' => [
		'name' => 'Марий Эл', // Республика Марий Эл
		'lat'  => '56.42',
		'lon'  => '47.52',
		'code' => '12'
	],
	'RU-MO' => [
		'name' => 'Мордовия', // Республика Мордовия
		'lat'  => '54.26',
		'lon'  => '44.27',
		'code' => '13'
	],
	'RU-SA' => [
		'name' => 'Республика Саха (Якутия)',
		'lat'  => '66.24',
		'lon'  => '129.10',
		'code' => '14'
	],
	'RU-SE' => [
		'name' => 'Северная Осетия - Алания', // Республика Северная Осетия — Алания
		'lat'  => '43.11',
		'lon'  => '44.14',
		'code' => '15'
	],
	'RU-TA' => [
		'name' => 'Татарстан', // Республика Татарстан
		'lat'  => '55.33',
		'lon'  => '50.56',
		'code' => '16'
	],
	'RU-TY' => [
		'name' => 'Республика Тыва',
		'lat'  => '51.47',
		'lon'  => '94.45',
		'code' => '17'
	],
	'RU-UD' => [
		'name' => 'Удмуртия', // Удмуртская республика
		'lat'  => '57.17',
		'lon'  => '52.45',
		'code' => '18'
	],
	'RU-KK' => [
		'name' => 'Республика Хакасия',
		'lat'  => '53.30',
		'lon'  => '90.00',
		'code' => '19'
	],
	'RU-CE' => [
		'name' => 'Чечня', // Чеченская республика
		'lat'  => '43.24',
		'lon'  => '45.43',
		'code' => '20'
	],
	'RU-CU' => [
		'name' => 'Чувашия', // Чувашская республика
		'lat'  => '55.27',
		'lon'  => '47.05',
		'code' => '21'
	],
	'RU-ALT' => [
		'name' => 'Алтайский край',
		'lat'  => '52.46',
		'lon'  => '82.37',
		'code' => '22'
	],
	'RU-ZAB' => [
		'name' => 'Забайкальский край',
		'lat'  => '54.00',
		'lon'  => '118.00',
		'code' => '75'
	],
	'RU-KAM' => [
		'name' => 'Камчатский край',
		'lat'  => '56.00',
		'lon'  => '159.00',
		'code' => '41'
	],
	'RU-KDA' => [
		'name' => 'Краснодарский край',
		'lat'  => '45.22',
		'lon'  => '39.26',
		'code' => '23'
	],
	'RU-KYA' => [
		'name' => 'Красноярский край',
		'lat'  => '59.53',
		'lon'  => '91.40',
		'code' => '24'
	],
	'RU-PER' => [
		'name' => 'Пермский край',
		'lat'  => '59.14',
		'lon'  => '56.08',
		'code' => '59'
	],
	'RU-PRI' => [
		'name' => 'Приморский край',
		'lat'  => '45.20',
		'lon'  => '134.40',
		'code' => '25'
	],
	'RU-STA' => [
		'name' => 'Ставропольский край',
		'lat'  => '45.03',
		'lon'  => '43.16',
		'code' => '26'
	],
	'RU-KHA' => [
		'name' => 'Хабаровский край',
		'lat'  => '54.48',
		'lon'  => '136.50',
		'code' => '27'
	],
	'RU-AMU' => [
		'name' => 'Амурская область',
		'lat'  => '53.33',
		'lon'  => '127.50',
		'code' => '28'
	],
	'RU-ARK' => [
		'name' => 'Архангельская область',
		'lat'  => '63.30',
		'lon'  => '43.00',
		'code' => '29'
	],
	'RU-AST' => [
		'name' => 'Астраханская область',
		'lat'  => '47.14',
		'lon'  => '47.14',
		'code' => '30'
	],
	'RU-BEL' => [
		'name' => 'Белгородская область',
		'lat'  => '50.46',
		'lon'  => '37.27',
		'code' => '31'
	],
	'RU-BRY' => [
		'name' => 'Брянская область',
		'lat'  => '52.57',
		'lon'  => '33.24',
		'code' => '32'
	],
	'RU-VLA' => [
		'name' => 'Владимирская область',
		'lat'  => '56.05',
		'lon'  => '40.37',
		'code' => '33'
	],
	'RU-VGG' => [
		'name' => 'Волгоградская область',
		'lat'  => '49.44',
		'lon'  => '44.07',
		'code' => '34'
	],
	'RU-VLG' => [
		'name' => 'Вологодская область',
		'lat'  => '60.05',
		'lon'  => '40.27',
		'code' => '35'
	],
	'RU-VOR' => [
		'name' => 'Воронежская область',
		'lat'  => '51.03',
		'lon'  => '40.09',
		'code' => '36'
	],
	'RU-IVA' => [
		'name' => 'Ивановская область',
		'lat'  => '57.01',
		'lon'  => '41.31',
		'code' => '37'
	],
	'RU-IRK' => [
		'name' => 'Иркутская область',
		'lat'  => '57.22',
		'lon'  => '106.00',
		'code' => '38'
	],
	'RU-KGD' => [
		'name' => 'Калининградская область',
		'lat'  => '54.48',
		'lon'  => '21.25',
		'code' => '39'
	],
	'RU-KLU' => [
		'name' => 'Калужская область',
		'lat'  => '54.26',
		'lon'  => '35.26',
		'code' => '40'
	],
	'RU-KEM' => [
		'name' => 'Кемеровская область',
		'lat'  => '54.56',
		'lon'  => '87.14',
		'code' => '42'
	],
	'RU-KIR' => [
		'name' => 'Кировская область',
		'lat'  => '58.46',
		'lon'  => '49.50',
		'code' => '43'
	],
	'RU-KOS' => [
		'name' => 'Костромская область',
		'lat'  => '58.33',
		'lon'  => '43.41',
		'code' => '44'
	],
	'RU-KGN' => [
		'name' => 'Курганская область',
		'lat'  => '55.34',
		'lon'  => '64.45',
		'code' => '45'
	],
	'RU-KRS' => [
		'name' => 'Курская область',
		'lat'  => '51.45',
		'lon'  => '36.01',
		'code' => '46'
	],
	'RU-LEN' => [
		'name' => 'Ленинградская область',
		'lat'  => '60.03',
		'lon'  => '31.45',
		'code' => '47'
	],
	'RU-LIP' => [
		'name' => 'Липецкая область',
		'lat'  => '52.42',
		'lon'  => '39.09',
		'code' => '48'
	],
	'RU-MAG' => [
		'name' => 'Магаданская область',
		'lat'  => '62.54',
		'lon'  => '153.42',
		'code' => '49'
	],
	'RU-MOS' => [
		'name' => 'Московская область',
		'lat'  => '55.37',
		'lon'  => '37.44',
		'code' => '50'
	],
	'RU-MUR' => [
		'name' => 'Мурманская область',
		'lat'  => '68.02',
		'lon'  => '34.34',
		'code' => '51'
	],
	'RU-NIZ' => [
		'name' => 'Нижегородская область',
		'lat'  => '56.29',
		'lon'  => '44.32',
		'code' => '52'
	],
	'RU-NGR' => [
		'name' => 'Новгородская область',
		'lat'  => '58.26',
		'lon'  => '32.23',
		'code' => '53'
	],
	'RU-NVS' => [
		'name' => 'Новосибирская область',
		'lat'  => '55.27',
		'lon'  => '79.33',
		'code' => '54'
	],
	'RU-OMS' => [
		'name' => 'Омская область',
		'lat'  => '56.13',
		'lon'  => '73.16',
		'code' => '55'
	],
	'RU-ORE' => [
		'name' => 'Оренбургская область',
		'lat'  => '52.08',
		'lon'  => '55.36',
		'code' => '56'
	],
	'RU-ORL' => [
		'name' => 'Орловская область',
		'lat'  => '52.51',
		'lon'  => '36.26',
		'code' => '57'
	],
	'RU-PNZ' => [
		'name' => 'Пензенская область',
		'lat'  => '53.15',
		'lon'  => '44.34',
		'code' => '58'
	],
	'RU-PSK' => [
		'name' => 'Псковская область',
		'lat'  => '57.19',
		'lon'  => '29.15',
		'code' => '60'
	],
	'RU-ROS' => [
		'name' => 'Ростовская область',
		'lat'  => '47.52',
		'lon'  => '41.11',
		'code' => '61'
	],
	'RU-RYA' => [
		'name' => 'Рязанская область',
		'lat'  => '54.24',
		'lon'  => '40.36',
		'code' => '62'
	],
	'RU-SAM' => [
		'name' => 'Самарская область',
		'lat'  => '53.27',
		'lon'  => '50.27',
		'code' => '63'
	],
	'RU-SAR' => [
		'name' => 'Саратовская область',
		'lat'  => '51.47',
		'lon'  => '46.44',
		'code' => '64'
	],
	'RU-SAK' => [
		'name' => 'Сахалинская область',
		'lat'  => '50.33',
		'lon'  => '142.36',
		'code' => '65'
	],
	'RU-SVE' => [
		'name' => 'Свердловская область',
		'lat'  => '58.42',
		'lon'  => '61.20',
		'code' => '66'
	],
	'RU-SMO' => [
		'name' => 'Смоленская область',
		'lat'  => '55.00',
		'lon'  => '33.00',
		'code' => '67'
	],
	'RU-TAM' => [
		'name' => 'Тамбовская область',
		'lat'  => '52.43',
		'lon'  => '41.34',
		'code' => '68'
	],
	'RU-TVE' => [
		'name' => 'Тверская область',
		'lat'  => '57.09',
		'lon'  => '34.37',
		'code' => '69'
	],
	'RU-TOM' => [
		'name' => 'Томская область',
		'lat'  => '58.45',
		'lon'  => '82.08',
		'code' => '70'
	],
	'RU-TUL' => [
		'name' => 'Тульская область',
		'lat'  => '53.55',
		'lon'  => '37.35',
		'code' => '71'
	],
	'RU-TYU' => [
		'name' => 'Тюменская область',
		'lat'  => '57.50',
		'lon'  => '69.00',
		'code' => '72'
	],
	'RU-ULY' => [
		'name' => 'Ульяновская область',
		'lat'  => '53.57',
		'lon'  => '47.55',
		'code' => '73'
	],
	'RU-CHE' => [
		'name' => 'Челябинская область',
		'lat'  => '54.32',
		'lon'  => '60.20',
		'code' => '74'
	],
	'RU-YAR' => [
		'name' => 'Ярославская область',
		'lat'  => '57.52',
		'lon'  => '39.12',
		'code' => '76'
	],
	'RU-MOW' => [
		'name' => 'Москва',
		'lat'  => '55.45',
		'lon'  => '37.37',
		'code' => '77'
	],
	'RU-SPE' => [
		'name' => 'Санкт-Петербург',
		'lat'  => '59.57',
		'lon'  => '30.19',
		'code' => '78'
	],
	'RU-SEV' => [
		'name' => 'Севастополь',
		'lat'  => '44.36',
		'lon'  => '33.32',
		'code' => '92'
	],
	'RU-YEV' => [
		'name' => 'Еврейская автономная область',
		'lat'  => '48.28',
		'lon'  => '132.08',
		'code' => '79'
	],
	'RU-NEN' => [
		'name' => 'Ненецкий автономный округ',
		'lat'  => '68.05',
		'lon'  => '54.50',
		'code' => '83'
	],
	'RU-KHM' => [
		'name' => 'Ханты-Мансийский автономный округ - Югра',
		'lat'  => '62.15',
		'lon'  => '70.10',
		'code' => '86'
	],
	'RU-CHU' => [
		'name' => 'Чукотский автономный округ',
		'lat'  => '66.15',
		'lon'  => '172.00',
		'code' => '87'
	],
	'RU-YAN' => [
		'name' => 'Ямало-Ненецкий автономный округ',
		'lat'  => '67.15',
		'lon'  => '74.40',
		'code' => '89'
	]
];
