<?php
$RU = [
	'RU-AD' => array(
		'name' => 'Республика Адыгея',
		'lat'  => '44.39',
		'lon'  => '40.00',
	),
	'RU-AL' => array(
		'name' => 'Республика Алтай',
		'lat'  => '50.55',
		'lon'  => '86.55',
	),
	'RU-BA' => array(
		'name' => 'Республика Башкортостан',
		'lat'  => '54.28',
		'lon'  => '56.16',
	),
	'RU-BU' => array(
		'name' => 'Республика Бурятия',
		'lat'  => '53.48',
		'lon'  => '109.20',
	),
	'RU-DA' => array(
		'name' => 'Республика Дагестан',
		'lat'  => '43.06',
		'lon'  => '46.53',
	),
	'RU-IN' => array(
		'name' => 'Республика Ингушетия',
		'lat'  => '43.12',
		'lon'  => '44.58',
	),
	'RU-KB' => array(
		'name' => 'Кабардино-Балкарская республика',
		'lat'  => '43.35',
		'lon'  => '43.24',
	),
	'RU-KL' => array(
		'name' => 'Республика Калмыкия',
		'lat'  => '46.34',
		'lon'  => '45.19',
	),
	'RU-KC' => array(
		'name' => 'Карачаево-Черкесская республика',
		'lat'  => '43.55',
		'lon'  => '41.47',
	),
	'RU-KR' => array(
		'name' => 'Республика Карелия',
		'lat'  => '63.49',
		'lon'  => '33.00',
	),
	'RU-KO' => array(
		'name' => 'Республика Коми',
		'lat'  => '64.17',
		'lon'  => '54.28',
	),
	'RU-CR' => array(
		'name' => 'Республика Крым',
		'lat'  => '44.56',
		'lon'  => '34.06',
	),
	'RU-ME' => array(
		'name' => 'Республика Марий Эл',
		'lat'  => '56.42',
		'lon'  => '47.52',
	),
	'RU-MO' => array(
		'name' => 'Республика Мордовия',
		'lat'  => '54.26',
		'lon'  => '44.27',
	),
	'RU-SA' => array(
		'name' => 'Республика Саха (Якутия)',
		'lat'  => '66.24',
		'lon'  => '129.10',
	),
	'RU-SE' => array(
		'name' => 'Республика Северная Осетия — Алания',
		'lat'  => '43.11',
		'lon'  => '44.14',
	),
	'RU-TA' => array(
		'name' => 'Республика Татарстан',
		'lat'  => '55.33',
		'lon'  => '50.56',
	),
	'RU-TY' => array(
		'name' => 'Республика Тыва',
		'lat'  => '51.47',
		'lon'  => '94.45',
	),
	'RU-UD' => array(
		'name' => 'Удмуртская республика',
		'lat'  => '57.17',
		'lon'  => '52.45',
	),
	'RU-KK' => array(
		'name' => 'Республика Хакасия',
		'lat'  => '53.30',
		'lon'  => '90.00',
	),
	// FIXME: далее исправить
	// где есть имена уже исправлены
	'RU-ARK' => array(
		'name' => '',
		'lat'  => '64',
		'lon'  => '41',
	),
	'RU-BRY' => array(
		'name' => '',
		'lat'  => '52.95',
		'lon'  => '34.04',
	),
	'RU-BEL' => array(
		'name' => '',
		'lat'  => '50.80',
		'lon'  => '37.66',
	),
	'RU-CU' => array(
		'name' => '',
		'lat'  => '55.48',
		'lon'  => '47.19',
	),
	'RU-KDA' => array(
		'name' => '',
		'lat'  => '45.143',
		'lon'  => '39.133',
	),
	'RU-KEM' => array(
		'name' => '',
		'lat'  => '54.56',
		'lon'  => '86.93',
	),
	'RU-KHA'=> array(
		'name' => '',
		'lat'  => '55.37',
		'lon'  => '138.80',
	),
	'RU-KHM'=> array(
		'name' => '',
		'lat'  => '62.41',
		'lon'  => '72.9',
	),
	'RU-KGD' => array(
		'name' => '',
		'lat'  => '54.71',
		'lon'  => '21.58',
	),
	'RU-KIR' => array(
		'name' => '',
		'lat'  => '58.65',
		'lon'  => '50.098',
	),
	'RU-KYA' => array(
		'name' => '',
		'lat'  => '71.75',
		'lon'  => '94.92',
	),
	'RU-LIP' => array(
		'name' => '',
		'lat'  => '52.75',
		'lon'  => '39.28',
	),
	'RU-LEN' => array(
		'name' => 'Ленинградская область',
		'lat'  => '60.03',
		'lon'  => '31.45',
	),
	'RU-MOS' => array(
		'name' => 'Московская область',
		'lat'  => '55.34',
		'lon'  => '37.44',
	),
	'RU-MOW' => array(
		'name' => 'Москва',
		'lat'  => '55.45',
		'lon'  => '37.37',
	),
	'RU-MUR' => array(
		'name' => '',
		'lat'  => '67.9',
		'lon'  => '34.89',
	),
	'RU-RYA' => array(
		'name' => '',
		'lat'  => '54.34',
		'lon'  => '40.68',
	),
	'RU-TVE' => array(
		'name' => '',
		'lat'  => '57.28',
		'lon'  => '34.53',
	),
	'RU-ROS' => array(
		'name' => '',
		'lat'  => '47.222531',
		'lon'  => '39.718705',
	),
	'RU-SPE' => array(
		'name' => 'Санкт-Петербург',
		'lat'  => '59.57',
		'lon'  => '30.19',
	),
	'RU-PNZ' => array(
		'name' => '',
		'lat'  => '53.170',
		'lon'  => '44.533',
	),
	'RU-CHE' => array(
		'name' => '',
		'lat'  => '54.444',
		'lon'  => '60.535',
	),
	'RU-VLA' => array(
		'name' => '',
		'lat'  => '55.96',
		'lon'  => '40.622',
	),
	'RU-PER' => array(
		'name' => '',
		'lat'  => '59.052',
		'lon'  => '55.767',
	),
	'RU-NVS' => array(
		'name' => '',
		'lat'  => '55.342',
		'lon'  => '80.156',
	),
	'RU-OMS' => array(
		'name' => '',
		'lat'  => '56.19',
		'lon'  => '73.411',
	),
	'RU-IRK' => array(
		'name' => '',
		'lat'  => '58.03',
		'lon'  => '108.237',
	),
	'RU-PRI' => array(
		'name' => '',
		'lat'  => '45.41',
		'lon'  => '134.91',
	),
	'RU-ULY' => array(
		'name' => '',
		'lat'  => '53.74',
		'lon'  => '48.02',
	),
	'RU-VGG' => array(
		'name' => '',
		'lat'  => '49.368',
		'lon'  => '44.297',
	),
	'RU-VLG' => array(
		'name' => '',
		'lat'  => '59.220492',
		'lon'  => '39.891568',
	),
	'RU-VOR' => array(
		'name' => '',
		'lat'  => '50.85',
		'lon'  => '40.54',
	),
	'RU-IVA' => array(
		'name' => 'Ивановская область',
		'lat'  => '57.01',
		'lon'  => '41.31',
	),
];