<?php
$RU = [
	'RU-AD' => [
		'name' => 'Республика Адыгея',
		'lat'  => '44.39',
		'lon'  => '40.00',
	],
	'RU-AL' => [
		'name' => 'Республика Алтай',
		'lat'  => '50.55',
		'lon'  => '86.55',
	],
	'RU-BA' => [
		'name' => 'Республика Башкортостан',
		'lat'  => '54.28',
		'lon'  => '56.16',
	],
	'RU-BU' => [
		'name' => 'Республика Бурятия',
		'lat'  => '53.48',
		'lon'  => '109.20',
	],
	'RU-DA' => [
		'name' => 'Республика Дагестан',
		'lat'  => '43.06',
		'lon'  => '46.53',
	],
	'RU-IN' => [
		'name' => 'Республика Ингушетия',
		'lat'  => '43.12',
		'lon'  => '44.58',
	],
	'RU-KB' => [
		'name' => 'Кабардино-Балкарская республика',
		'lat'  => '43.35',
		'lon'  => '43.24',
	],
	'RU-KL' => [
		'name' => 'Республика Калмыкия',
		'lat'  => '46.34',
		'lon'  => '45.19',
	],
	'RU-KC' => [
		'name' => 'Карачаево-Черкесская республика',
		'lat'  => '43.55',
		'lon'  => '41.47',
	],
	'RU-KR' => [
		'name' => 'Республика Карелия',
		'lat'  => '63.49',
		'lon'  => '33.00',
	],
	'RU-KO' => [
		'name' => 'Республика Коми',
		'lat'  => '64.17',
		'lon'  => '54.28',
	],
	'RU-CR' => [
		'name' => 'Республика Крым',
		'lat'  => '44.56',
		'lon'  => '34.06',
	],
	'RU-ME' => [
		'name' => 'Республика Марий Эл',
		'lat'  => '56.42',
		'lon'  => '47.52',
	],
	'RU-MO' => [
		'name' => 'Республика Мордовия',
		'lat'  => '54.26',
		'lon'  => '44.27',
	],
	'RU-SA' => [
		'name' => 'Республика Саха (Якутия)',
		'lat'  => '66.24',
		'lon'  => '129.10',
	],
	'RU-SE' => [
		'name' => 'Республика Северная Осетия — Алания',
		'lat'  => '43.11',
		'lon'  => '44.14',
	],
	'RU-TA' => [
		'name' => 'Республика Татарстан',
		'lat'  => '55.33',
		'lon'  => '50.56',
	],
	'RU-TY' => [
		'name' => 'Республика Тыва',
		'lat'  => '51.47',
		'lon'  => '94.45',
	],
	'RU-UD' => [
		'name' => 'Удмуртская республика',
		'lat'  => '57.17',
		'lon'  => '52.45',
	],
	'RU-KK' => [
		'name' => 'Республика Хакасия',
		'lat'  => '53.30',
		'lon'  => '90.00',
	],
	'RU-CE' => [
		'name' => 'Чеченская республика',
		'lat'  => '43.24',
		'lon'  => '45.43',
	],
	'RU-CU' => [
		'name' => 'Чувашская республика',
		'lat'  => '55.27',
		'lon'  => '47.05',
	],
	'RU-ALT' => [
		'name' => 'Алтайский край',
		'lat'  => '52.46',
		'lon'  => '82.37',
	],
	'RU-ZAB' => [
		'name' => 'Забайкальский край',
		'lat'  => '54.00',
		'lon'  => '118.00',
	],
	'RU-KAM' => [
		'name' => 'Камчатский край',
		'lat'  => '56.00',
		'lon'  => '159.00',
	],
	'RU-KDA' => [
		'name' => 'Краснодарский край',
		'lat'  => '45.22',
		'lon'  => '39.26',
	],
	'RU-KYA' => [
		'name' => 'Красноярский край',
		'lat'  => '59.53',
		'lon'  => '91.40',
	],
	'RU-PER' => [
		'name' => 'Пермский край',
		'lat'  => '59.14',
		'lon'  => '56.08',
	],
	'RU-PRI' => [
		'name' => 'Приморский край',
		'lat'  => '45.20',
		'lon'  => '134.40',
	],
	'RU-STA' => [
		'name' => 'Ставропольский край',
		'lat'  => '45.03',
		'lon'  => '43.16',
	],
	'RU-KHA' => [
		'name' => 'Хабаровский край',
		'lat'  => '54.48',
		'lon'  => '136.50',
	],
	'RU-AMU' => [
		'name' => 'Амурская область',
		'lat'  => '53.33',
		'lon'  => '127.50',
	],
	'RU-ARK' => [
		'name' => 'Архангельская область',
		'lat'  => '63.30',
		'lon'  => '43.00',
	],
	'RU-AST' => [
		'name' => 'Астраханская область',
		'lat'  => '47.14',
		'lon'  => '47.14',
	],
	'RU-BEL' => [
		'name' => 'Белгородская область',
		'lat'  => '50.46',
		'lon'  => '37.27',
	],
	'RU-BRY' => [
		'name' => 'Брянская область',
		'lat'  => '52.57',
		'lon'  => '33.24',
	],
	'RU-VLA' => [
		'name' => 'Владимирская область',
		'lat'  => '56.05',
		'lon'  => '40.37',
	],
	'RU-VGG' => [
		'name' => 'Волгоградская область',
		'lat'  => '49.44',
		'lon'  => '44.07',
	],
	'RU-VLG' => [
		'name' => 'Вологодская область',
		'lat'  => '60.05',
		'lon'  => '40.27',
	],
	'RU-VOR' => [
		'name' => 'Воронежская область',
		'lat'  => '51.03',
		'lon'  => '40.09',
	],
	'RU-IVA' => [
		'name' => 'Ивановская область',
		'lat'  => '57.01',
		'lon'  => '41.31',
	],
	'RU-IRK' => [
		'name' => 'Иркутская область',
		'lat'  => '57.22',
		'lon'  => '106.00',
	],
	'RU-KGD' => [
		'name' => 'Калининградская область',
		'lat'  => '54.48',
		'lon'  => '21.25',
	],
	'RU-KLU' => [
		'name' => 'Калужская область',
		'lat'  => '54.26',
		'lon'  => '35.26',
	],
	'RU-KEM' => [
		'name' => 'Кемеровская область',
		'lat'  => '54.56',
		'lon'  => '87.14',
	],
	'RU-KIR' => [
		'name' => 'Кировская область',
		'lat'  => '58.46',
		'lon'  => '49.50',
	],
	'RU-KOS' => [
		'name' => 'Костромская область',
		'lat'  => '58.33',
		'lon'  => '43.41',
	],
	'RU-KGN' => [
		'name' => 'Курганская область',
		'lat'  => '55.34',
		'lon'  => '64.45',
	],
	'RU-KRS' => [
		'name' => 'Курская область',
		'lat'  => '51.45',
		'lon'  => '36.01',
	],
	'RU-LEN' => [
		'name' => 'Ленинградская область',
		'lat'  => '60.03',
		'lon'  => '31.45',
	],
	'RU-LIP' => [
		'name' => 'Липецкая область',
		'lat'  => '52.42',
		'lon'  => '39.09',
	],
	'RU-MAG' => [
		'name' => 'Магаданская область',
		'lat'  => '62.54',
		'lon'  => '153.42',
	],
	'RU-MOS' => [
		'name' => 'Московская область',
		'lat'  => '55.37',
		'lon'  => '37.44',
	],
	'RU-MUR' => [
		'name' => 'Мурманская область',
		'lat'  => '68.02',
		'lon'  => '34.34',
	],
	'RU-NIZ' => [
		'name' => 'Нижегородская область',
		'lat'  => '56.29',
		'lon'  => '44.32',
	],
	'RU-NGR' => [
		'name' => 'Новгородская область',
		'lat'  => '58.26',
		'lon'  => '32.23',
	],
	'RU-NVS' => [
		'name' => 'Новосибирская область',
		'lat'  => '55.27',
		'lon'  => '79.33',
	],
	'RU-OMS' => [
		'name' => 'Омская область',
		'lat'  => '56.13',
		'lon'  => '73.16',
	],
	'RU-ORE' => [
		'name' => 'Оренбургская область',
		'lat'  => '52.08',
		'lon'  => '55.36',
	],
	'RU-ORL' => [
		'name' => 'Орловская область',
		'lat'  => '52.51',
		'lon'  => '36.26',
	],
	'RU-PNZ' => [
		'name' => 'Пензенская область',
		'lat'  => '53.15',
		'lon'  => '44.34',
	],
	'RU-PSK' => [
		'name' => 'Псковская область',
		'lat'  => '57.19',
		'lon'  => '29.15',
	],
	'RU-ROS' => [
		'name' => 'Ростовская область',
		'lat'  => '47.52',
		'lon'  => '41.11',
	],
	'RU-RYA' => [
		'name' => 'Рязанская область',
		'lat'  => '54.24',
		'lon'  => '40.36',
	],
	'RU-SAM' => [
		'name' => 'Самарская область',
		'lat'  => '53.27',
		'lon'  => '50.27',
	],
	'RU-SAR' => [
		'name' => 'Саратовская область',
		'lat'  => '51.47',
		'lon'  => '46.44',
	],
	'RU-SAK' => [
		'name' => 'Сахалинская область',
		'lat'  => '50.33',
		'lon'  => '142.36',
	],
	'RU-SVE' => [
		'name' => 'Свердловская область',
		'lat'  => '58.42',
		'lon'  => '61.20',
	],
	'RU-SMO' => [
		'name' => 'Смоленская область',
		'lat'  => '55.00',
		'lon'  => '33.00',
	],
	'RU-TAM' => [
		'name' => 'Тамбовская область',
		'lat'  => '52.43',
		'lon'  => '41.34',
	],
	'RU-TVE' => [
		'name' => 'Тверская область',
		'lat'  => '57.09',
		'lon'  => '34.37',
	],
	'RU-TOM' => [
		'name' => 'Томская область',
		'lat'  => '58.45',
		'lon'  => '82.08',
	],
	'RU-TUL' => [
		'name' => 'Тульская область',
		'lat'  => '53.55',
		'lon'  => '37.35',
	],
	'RU-TYU' => [
		'name' => 'Тюменская область',
		'lat'  => '57.50',
		'lon'  => '69.00',
	],
	'RU-ULY' => [
		'name' => 'Ульяновская область',
		'lat'  => '53.57',
		'lon'  => '47.55',
	],
	'RU-CHE' => [
		'name' => 'Челябинская область',
		'lat'  => '54.32',
		'lon'  => '60.20',
	],
	'RU-YAR' => [
		'name' => 'Ярославская область',
		'lat'  => '57.52',
		'lon'  => '39.12',
	],
	'RU-MOW' => [
		'name' => 'Москва',
		'lat'  => '55.45',
		'lon'  => '37.37',
	],
	'RU-SPE' => [
		'name' => 'Санкт-Петербург',
		'lat'  => '59.57',
		'lon'  => '30.19',
	],
	'RU-SEV' => [
		'name' => 'Севастополь',
		'lat'  => '44.36',
		'lon'  => '33.32',
	],
	'RU-YEV' => [
		'name' => 'Еврейская автономная область',
		'lat'  => '48.28',
		'lon'  => '132.08',
	],
	'RU-NEN' => [
		'name' => 'Ненецкий автономный округ',
		'lat'  => '68.05',
		'lon'  => '54.50',
	],
	'RU-KHM' => [
		'name' => 'Ханты-Мансийский автономный округ - Югра',
		'lat'  => '62.15',
		'lon'  => '70.10',
	],
	'RU-CHU' => [
		'name' => 'Чукотский автономный округ',
		'lat'  => '66.15',
		'lon'  => '172.00',
	],
	'RU-YAN' => [
		'name' => 'Ямало-Ненецкий автономный округ',
		'lat'  => '67.15',
		'lon'  => '74.40',
	]
];